# 1st task
print('\t======ПЕРШЕ ЗАВДАННЯ======\n')
print('To be \n\n\t or not \n\n\t\tto be...\n\n\t\t\t\\ William Shakespeare \\\n\n')
# 2d task
print('\t======ДРУГЕ ЗАВДАННЯ======\n')
print('    ГРУДЕНЬ 2024\nПН ВТ СР ЧТ ПТ СБ НД\n                   1\n 2  3  4  5  6  7  8\n 9 10 11 12 13 14 15\n16 17 18 19 20 21 22\n23 24 25 26 27 28 29\n30 31')
#3th task
print('\n\t======ТРЕТЄ ЗАВДАННЯ======\n')
print('____________^v^_____^v^\n_________HHHH___^v^\n_______HHHHHHH_____^v^\n______HHHHHHHHHH_________/\n____HHHHHHHHHHHHH_____--- ---\n__HHHHHHHHHHHHHHHHH_____/_\n___HHHHHHHHHHHHHHH____^v^\n____HHHHHHHHHHHHH________^v^\n_______HHI_IHHHH_______HHHH\n_________I_I___________HHHH\n___HHHHHHHHHHHHHHHHHHHHHHHHHH\n__HHHHHHHHHHHHHHHHHHHHHHHHHHHH\n_HHHHHHHHHHHHHHHHHHHHHHHHHHHHHH\nHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH\n___H_________________________H\n___H__HHHHHH__HHHHH__HHHHH___H\n___H__HHHHHH__HHHHH__HHHHH___H\n___H__HHHHHH__HHHHH__HHHHH___H\n___H__HHHHHH_________________H__o\n___H__HHHHHH_________________H_(|/)\n___HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH\n')
#4th task
print('\t======ЧЕТВЕРТЕ ЗАВДАННЯ======\n')
print('\t\t\tРЕЗЮМЕ\n\nП.І.Б.\t\t\tВасиленко Костянтин Олегович\nМісце проживання \tЧеркаси\nТелефон\t\t\t063 266-62-69\nЕл. пошта \t\tkosrounder@gmail.com\n\n\t\tОсвіта\n\nЧеркаський інститут банківської справи \nУніверситету банківської справи \nНаціонального банку України\nНапрям підготовки: Економіка та підприємництво\nСпеціальність: Облік і аудит \nКваліфікація: Магістр з обліку і аудиту.')
print('\n\tНавички та знання \n\n*законодавчі та нормативні правові акти, матеріали з організації фінансової роботи, економіка виробництва\n*бухгалтерський облік\n*порядок і форми фінансових розрахунків\n*правила фінансування з державного бюджету, довгострокового і короткострокового кредитування\n*порядок залучення позикових та використання власних коштів, нарахування та сплати платежів до державного бюджету, податкових органів, банківських установ \n*порядок розподілення фінансових ресурсів\n*організація виробництва, праці та управління\n*основи трудового законодавства\n*правила і норми охорони праці\n*автоматизовані системи «Клієнт-банк», 1:С 8.2, 8.3, MS Office\n*організація документообороту.')
