print("======ОПЕРАЦІЇ ВВЕДЕННЯ/ВИВЕДЕННЯ======\n")
print("======ПЕРШЕ ЗАВДАННЯ======\n")
a = float(input("Введіть перше число "))
b = float(input("Введіть друге число "))
print("\nРЕЗУЛЬТАТИ ОБЧИСЛЕНЬ\n")
print("1. a + b = ", end=(""))
print(a + b)  
print("2. a - b = ", end=(""))
print(a - b)
print("3. a / b = ", end=(""))
print(a / b)
print("4. a * b = ", end=(""))
print(a * b)      

print("\n======ДРУГЕ ЗАВДАННЯ======\n")
val = float(
    input("Введіть число для обчислень ")
    )
perc = float(
    input("Введіть відсоток, який потрібно порахувати ")
    )

print("\nРЕЗУЛЬТАТИ ОБЧИСЛЕНЬ\n")
perc *= 0.01
print("Ваше число ", end=("") )
print(val * perc)

print("\n======ТРЕТЄ ЗАВДАННЯ======\n")
print("Програма обчислює площу прямокутника")
w = float(input("Введіть ширину "))
h = float(input("Введіть висоту "))
print("Площа прямокутника буде ", end=(""))
print(w * h)

print("\n======ЧЕТВЕРТЕ ЗАВДАННЯ======\n")
print("Програма конвертує температуру \nЦельсія->Фаренгейта")
c = float(input("\nВведіть температуру \nв градусах Цельсія "))
print("\nТемпература в градусах \nФаренгейту буде ", end=(""))
print(c * 1.8 + 32)

print("\n======РОБОТА З ЧИСЛАМИ ТА ОБЧИСЛЕННЯМИ======")
print("\n======ПЕРШЕ ЗАВДАННЯ======\n")
print("програма знаходить середнє арифметичне значення \nтрьох введених дробових чисел")
n1 = float(input("\nВведіть перше число "))
n2 = float(input("Введіть друге число "))
n3 = float(input("Введіть третє число "))
av = (n1 + n2 + n3) / 3
print("\nСереднє арифметичне чисел: ", end=(""))
print(av)

print("\n======ДРУГЕ ЗАВДАННЯ======\n")
print("Програма обчислює вказану ступінь заданого числа")
n4 = float(input("Введіть число для обчислень "))
st = int(input("Введіть ступінь числа "))
print("\nВідповідь: ", end=(""))
print(n4 ** st)

print("\n======ТРЕТЄ ЗАВДАННЯ======\n")
print("Програма обчислює площу кола \nта довжину окружності")
r = float(input("Введіть радіус фігури "))
PI = 3.14159265358979323846264338327950288419716939937510
print("\nДовжина окружності")
print(round(2 * PI * r, 2))
print("\nПлоща кола")
print(round(PI * (r ** 2), 2))

print("\n======ЧЕТВЕРТЕ ЗАВДАННЯ======\n")
print("Програма ковертує задану кількість UAH в USD, EUR та BTC")
print("Дані станом на 08.12.24")
print("1 USD = 41.5975 UAH\n1 EUR = 43.815 UAH\n1 BTC = 4 136 350.00 UAH")
uah = float(
    input("Введіть к-сть гривень що хочете конвертувати\n")
    )
print("Кількість USD ", end=(""))
print(round(uah / 41.5975, 2))
print("Кількість EUR ", end=(""))
print(round(uah / 43.815, 2))
print("Кількість BTC ", end=(""))
print(round(uah / 4_136_350, 12))

print("\n======П\'ЯТЕ ЗАВДАННЯ======\n")
print("Програма ковертує кілометри в \nсухопутні та морські милі")
km = float(input("Введіть кілометри "))
print("Кількість сухопутних миль ", end=(""))
print(round(km / 1.609344, 5))
print("Кількість морських миль ", end=(""))
print(round(km / 1.852, 5))

print("\n======ШОСТЕ ЗАВДАННЯ======\n")
print("Програма міняє місцями змінні")
#І варіант з трьома змінними
a1 = input("Введіть першу змінну ")
a2 = input("Введіть другу змінну ")
print(a1, a2)
a3 = a2
a2 = a1
a1 = a3
print(a1, a2)
#ІІ варіант з двома змінними
#a4 = input("Введіть першу змінну ")
#a5 = a4
#a4 = input("Введіть другу змінну ")
#print(a4, a5)

print("\n======Завдання на роботу з числами та рядками======\n")
print("\n======ПЕРШЕ ЗАВДАННЯ======\n")
n31 = input("Введіть І триначне число ")
n32 = input("Введіть ІI триначне число ")
n311 = n31[0] + n32[1] + n31[2]
print(n311)
n312 = n32[0] + n31[1] + n32[2]
print(n312)

print("\n======ДРУГЕ ЗАВДАННЯ======\n")
n33 = input("Введіть 4-значне число ")
d1 = int(n33[0])
d2 = int(n33[1])
d3 = int(n33[2])
d4 = int(n33[3])
print("сума")
print(d1 + d3)
print("різниця")
print(d2 - d4)
#================2 варіант
#print(int(n33[0]) + int(n33[2]))
#print(int(n33[1]) - int(n33[3]))

print("\n======ТРЕТЄ ЗАВДАННЯ======\n")
n34 = input("Введіть триначне число ")
print(n34[0] + n34[2])

print("\n======ЧЕТВЕРТЕ ЗАВДАННЯ======\n")
dep = float(input("Введіть суму депозиту "))
apy = float(input("Введіть річний відсоток % "))
print("Щомісячна виплата становить ")
print(round(dep * apy / 100 / 12, 2), end=("") )
print(" грн.")

print("\n======П\'ЯТЕ ЗАВДАННЯ======\n")
p = float(input("Введіть к-сть фунтів "))
print("вага у кілограмах становить ")
print(p * 0.4059, end=(""))
print(" kg")
kg = float(input("Тепер введіть к-сть кг "))
print("вага у фунтах становить ")
print(kg / 0.4059, end=(""))
print(" pounds")

print("\n======ШОСТЕ ЗАВДАННЯ======\n")
n66 = input("Введіть триначне число ")
print(n66[2] + n66[1] + n66[0])

print("\n============ЗАДАЧА ПРО ПЛАНЕТИ============")
print("\nМаса планет\n")
pl1 = 330.2 #mercury
print("МЕРКУРІЙ " + str(pl1) + "*10^21 kg")
pl2 = 4868.5 #venus
print("ВЕНЕРА " + str(pl2) + "*10^21 kg")
pl3 = 5973.6 #earth
print("ЗЕМЛЯ " + str(pl3) + "*10^21 kg")
pl4 = 641.85 #mars
print("МАРС " + str(pl4) + "*10^21 kg")
pl5 = 1898600. #jupiter
print("ЮПІТЕР " + str(pl5) + "*10^21 kg")
pl6 = 568460. #saturn
print("САТУРН " + str(pl6) + "*10^21 kg")
pl7 = 86832. #uranus
print("УРАН " + str(pl7) + "*10^21 kg")
pl8 = 102430. #neptune
print("НЕПТУН " + str(pl8) + "*10^21 kg")

print("\nЗагальна маса всіх планет")
m = pl1 + pl2 + pl3 + pl4 + pl5 + pl6 + pl7 + pl8
print(m, end=(""))
print("*10^21 kg")
print("\nСереднє арифметичне мас планет")
print(m / 8, end=(""))
print("*10^21 kg")

print("\nСтурктура мас планет")
print("МЕРКУРІЙ " + 
      str(round(pl1 / m * 100, 2)) + " %")
print("ВЕНЕРА " + 
      str(round(pl2 / m * 100, 2)) + " %")
print("ЗЕМЛЯ " + 
      str(round(pl3 / m * 100, 2)) + " %")
print("МАРС " + 
      str(round(pl4 / m * 100, 2)) + " %")
print("ЮПІТЕР " + 
      str(round(pl5 / m * 100, 2)) + " %")
print("САТУРН " + 
      str(round(pl6 / m * 100, 2)) + " %")
print("УРАН " + 
      str(round(pl7 / m * 100, 2)) + " %")
print("НЕПТУН " + 
      str(round(pl8 / m * 100 + 0.01, 2)) + " %")

print("\nМаса Юпітера в " + 
      str(round(pl5 / (m - pl5), 2)) + 
      " разів більша \nза масу всіх інших планет")

print("\n============ЗАДАЧА ПРО РЕМОНТ============")
print("\nБюджет для фарбування стін прямокутної кімнати\n")
l = float(input("Введіть  довжину кімнати в м "))
w = float(input("Введіть  ширину кімнати в м "))
h = float(input("Введіть  висоту кімнати в м "))
m = float(input("Який % складають вікна та двері "))
n = float(input("Який витрата фарби на 1 кв.м. "))
r = float(input("Який ціна фарби за літр "))
s = 2 * l * h + 2 * w * h
print("Отже ви збираєтесь пофарбувати " + 
      str(round(s - s * m / 100, 2)) + " кв.м. стін")
print("Для цього вам знадобиться " + 
      str(round((s - s * m / 100) * n * r), 2) + " гривень")