print("=====ЗАВДАННЯ НА ЗМІНУ ТИПІВ=====\n")
print("\nПЕРШЕ ЗАВДАННЯ\n")
a1 = float(input("введіть перше число "))
a2 = float(input("введіть друге число "))
print("сума цілих частин - ", end=(""))
print(int(a1) + int(a2))
print("сума дробових частин - ", end=(""))
print(round((a1 - int(a1)) + (a2-int(a2)), 2))

print("\nII ЗАВДАННЯ\n")
hrn = float(input("введіть суму в гривнях "))
print("ваша сума - " + str(
    int(hrn)) + " гривень " + str(
        int(round((hrn - int(hrn)) * 100, 2))) + " коп.")

print("\nIII ЗАВДАННЯ\n")
mass = float(input("введіть масу в тонах "))
# print("введена маса становить ")
# print(str(int(mass)) + " тон ", end=(""))
# print(str(int(((mass - int(mass)) * 1000))) + " кілограм ", end=(""))
# print(str(int(
#     (((mass - int(mass)) * 1000) - int((mass - int(mass)) * 1000)) * 1000)) + " грам ")
# II variant with variables
t = int(mass)
kg = (mass - int(mass)) * 1000
gr = (kg - int(kg)) * 1000
print(str(t) + " ton " + 
      str(int(kg)) + " kilo " + 
      str(int(gr)) + " grams")

print("\nIV ЗАВДАННЯ\n")
sec = int(input("введіть час в секундах "))
print(sec, end=(""))
print(" секунд це: ")
dn = int(sec / 86400)
sec -= dn * 86400
god = int(sec / 3600)
sec -= god * 3600
hv = int(sec / 60)
sec -= hv * 60
print(str(dn) + " днів " + 
       str(god) + " год " + 
       str(hv) + " хвилин " + 
       str(sec) + " секунд")

print("\nV ЗАВДАННЯ\n")
mbs = float(input("введіть швидкість інтернету в Mbit/s "))
gb = float(input("введіть розмір файлу в Gb "))
print("\n\n\nПри швидкості інтернету ", end=(""))
print(mbs, end=(""))
print(" Mbit/s \nта розміру файлу ", end=(""))
print(gb, end=(""))
print(" Gb \nчас завантаження буде:")
mbs *= 0.000125
sec1 = int(gb / mbs)
print(str(sec1) + " секунд, або ")
dn1 = int(sec1 / 86400)
sec1 -= dn1 * 86400
god1 = int(sec1 / 3600)
sec1 -= god1 * 3600
hv1 = int(sec1 / 60)
sec1 -= hv1 * 60
print(str(dn1) + " днів " + 
         str(god1) + " год " + 
         str(hv1) + " хвилин " + 
         str(sec1) + " секунд")

print("\nVI ЗАВДАННЯ\n")
n1 = float(input("введіть число для округлення\n"))
print("округлене число = " + str(round(n1, 2))) 

print("\nVII ЗАВДАННЯ\n")
hrn = float(input("Введіть суму в гривнях "))
term = float(input("Введіть строк в місяцях "))
perc = float(input("Введіть процент вкладу "))
print("Сума процентного доходу становитиме \n" + 
      str(round(hrn * perc / 100 / 12 * term, 2)) + " гривень")

print("=====ЗАВДАННЯ НА if-else, if-elif-else=====\n")
print("\nI ЗАВДАННЯ\n")
num1 = float(input("перше число "))
num2 = float(input("друге число "))
num3 = float(input("третє число "))
min = num1

if num2 < num1: min = num2

if num3 < min: min = num3

print("найменше число - " + str(min))

print("\nII ЗАВДАННЯ\n")
number_4 = float(input("введіть число "))

if number_4 > 0:
    print("ваше число позитивне")
elif number_4 < 0:
    print("ваше число негативне")
else:
    print("ваше число 0")     

print("\nIII ЗАВДАННЯ\n")   
number_5 = int(input("введіть число до 9999: "))

if int(number_5 / 1000) != 0:
    print("ваше число 4-зачне!")
elif int(number_5 / 100 % 10) != 0:
    print("ваше число 3-зачне!")
elif int(number_5 / 10 % 10) != 0:
    print("ваше число 2-зачне!")    
elif int(number_5 % 10) != 0:
    print("ваше число 1-зачне!")
else:
    print("ваше число - 0")     

print("\nIV ЗАВДАННЯ\n")

print("Введіть координати верхнього лівого кута прямокутника")  
corner_px1 , corner_py1 = int(input("x: ")), int(input("y: "))

print("Введіть координати нижнього правого кута прямокутника")  
corner_px2 , corner_py2 = int(input("x: ")), int(input("y: "))

print("Введіть координати точки для перевірки")  
check_px , check_py = int(input("x: ")), int(input("y: "))

if corner_px1 <= check_px <= corner_px2 and corner_py2 <= check_py <= corner_py1:
    print("точка належить прямокутнику")
else: print("точка не належить прямокутнику")   


print("\nV ЗАВДАННЯ\n")

print("Введіть координати І точки")  
line_px1 , line_py1 = int(input("x: ")), int(input("y: "))

print("Введіть координати ІІ точки")  
line_px2 , line_py2 = int(input("x: ")), int(input("y: "))

if line_px1 == line_px2: 
    print("пряма паралельна осі абсцис")
elif line_py1 == line_py2:
    print("пряма паралельна осі ординат")     
else: 
    print("пряма не паралельна жодній з осей")

print("\nVI ЗАВДАННЯ\n")

ticket_number = int(input("введіть номер квитка "))

digit_1 = int(ticket_number / 100000)
digit_2 = int(ticket_number / 10000 % 10)
digit_3 = int(ticket_number / 1000 % 10)
digit_4 = int(ticket_number / 100 % 10)
digit_5 = int(ticket_number / 10 % 10)
digit_6 = int(ticket_number % 10)

sum_1 = digit_1 + digit_2 + digit_3
sum_2 = digit_4 + digit_5 + digit_6

if sum_1 == sum_2:
    print("""
          +===============================+
          | Вітаємо, Ваш квиток щасливий! |
          +===============================+
          """)
else: print("Пощастить наступного разу")

print("=====Задачі на match-case=====\n")
print("\nI ЗАВДАННЯ\n")

num_1 = float(input("введіть І число "))
num_2 = float(input("введіть ІІ число "))
action = input("виберіть операцію: + - * / % : ")

match action:
    case "+":
        print(num_1 + num_2)
    case "-":
        print(num_1 - num_2)
    case "*":
        print(num_1 * num_2)
    case "/":
        if num_2 != 0 :
            print(num_1 / num_2)
        else:
            print("на 0 ділити не можна")   
    case "%":
        if num_2 != 0 :
            print(num_1 % num_2)
        else:
            print("на 0 ділити не можна")
    case _:
        print("невідома команда, повторіть запит")

print("\nII ЗАВДАННЯ\n")  
print("виберіть тварину зі списку:\n кіт, собака, корова, свиня, кінь, жаба:")
animal = input("")

match animal:
    case "кіт":
        print("- котик каже мяу")
    case "собака":
        print("- собачка каже гав")
    case "корова":
        print("- корівка каже мууу")
    case "свиня":
        print("- свинка каже хрю-хрю")
    case "кінь":
        print("- коник каже іго-го")
    case "жаба":
        print("- жабка каже ква-ква")

print("=====Задачі на тернарний оператор=====\n")
print("\nI ЗАВДАННЯ\n")
number_check = float(input("введіть число: "))

ans = "число парне" if number_check % 2 == 0 else "число непарне"

print(ans)

print("\nII ЗАВДАННЯ\n")
number_dia = float(input("введіть число: "))

ans_dia = "число належить діапазону" if 0 <= number_dia <= 100 else "число не належить діапазону"

print(ans_dia)

print("\nIII ЗАВДАННЯ\n")
number_krat = float(input("введіть число: "))

krat3 = bool(number_krat % 3 == 0)
krat5 = bool(number_krat % 5 == 0)
krat7 = bool(number_krat % 7 == 0)

ans_krat = "число кратне одночасно 3,5,7" if krat3==krat5==krat7==True else "число не кратне одночасно 3,5,7"

print(ans_krat)

print("\nIV ЗАВДАННЯ\n")
palindrom = int(input("введіть пятизначне число "))

if 10000 <= palindrom <= 99999:
    #визначення 1-5 цифри
    d1 = int(palindrom / 10000) 
    d2 = int(palindrom / 1000 % 10)
    d3 = int(palindrom / 100 % 10)
    d4 = int(palindrom / 10 % 10)
    d5 = int(palindrom % 10)

    if d1 == d5 and d2 == d4:
        print("Вітаємо! Ваше число - паліндром!")
    else: print("Число - не паліндром")

else: print("число не пятизначне, повторіть спробу")        

print("\nV ЗАВДАННЯ\n")
drob_check = float(input("введіть чило для перевірки "))
drob_part = drob_check - int(drob_check)

if drob_part != 0:
    print("Число має дробову частину")
else: print("Число не має дробову частину")

print("=====Задача на випадкові числа=====\n")
print("\nI ЗАВДАННЯ\n")

import random

print("Вас вітає МОЛЬФАР-3000!!!\nЯке Ваше питання:")

quest = (input(" "))
answear = str(random.randint(1, 5))

match answear:
    case "1":
        print("\nТак, безумовно!")
    case "2":
        print("\nШвидше за все, так.")
    case "3":
        print("\nМожливо, але не зараз.")
    case "4":
        print("\nСкоріше за все - ні")         
    case "5":
        print("\nНа жаль, ні.")       
    case _:
        print("")

print("\nЗАВДАННЯ ПРО ВАРТІСТЬ РОЗМОВИ\n")
print("Для розрхунку вводьте час у форматі hh:mm")
# введення даних
time_start = input("введіть час початку ромови ")
time_finish = input("введіть час закінчення ромови ")
price = 0.15
cost = 0
# перевірка чи правильний формат
if time_start[0] == "-" or time_finish[0] == "-":
    print("Невірний формат часу, перевірте данні")

else:
    # переведення в числовий формат
    h_start = int(time_start[0]) * 10 + int(time_start[1])
    m_start = int(time_start[3]) * 10 + int(time_start[4])

    h_finish = int(time_finish[0]) * 10 + int(time_finish[1])
    m_finish = int(time_finish[3]) * 10 + int(time_finish[4])
    # перевірка на правильність даних

    if h_start<=23 and h_finish<=23 and m_start<=59 and m_finish<=59:    
        #якщо час стосується однієї доби    

        if h_finish >= h_start:
            minutes_start = h_start * 60 + m_start
            minutes_finish = h_finish * 60 + m_finish
            cost = (minutes_finish - minutes_start) * price
        else:
            # якщо початок розмови - один день, а кінець - наступного дня
            minutes_start = h_start * 60 + m_start    
            minutes_finish = h_finish * 60 + m_finish + 1440        # 1440 - кількість хвилин в добі (24*60)
            cost = (minutes_finish - minutes_start) * price
        # виведення результату    
        print("\nтривалість розмови становить " + str(cost / price) + " хв.")
        print("вартість розмови - " + str(cost) + " грн.")    

    else:
        print("Невірний формат часу, перевірте данні")

print("\nЗАВДАННЯ ПРО ПЕРЕВІРКУ ДАТИ\n")

print("Для розрхунку вводьте дату у форматі dd-mm-yyyy")
date = input("введіть дату для перевірки ")

# string --> integer==================
day = int(date[0]) * 10 + int(date[1])
month = int(date[3]) * 10 + int(date[4])
year = int(date[6]) * 1000 + int(date[7]) * 100 + int(date[8]) * 10 + int(date[9])

# перевірка місяця==================
if 1 <= month <= 12:

    #перевірка якщо в місяці 31 день==================
    if (month == 1 or month == 3 
        or month == 5 or month == 7 
        or month == 8 or month == 10 
        or month == 12) and day > 31:
        print("Дата введена невірно")
        exit()

    #перевірка якщо в місяці 30 днів==================
    if (month == 4 or month == 6 
        or month == 9 or month == 11) and day > 30:
        print("Дата введена невірно")
        exit()

    #якщо лютий високосного року==================
    if (year % 4 == 0 and year % 100 != 0) or year % 400 == 0:
        if month == 2 and day > 29: 
            print("Дата введена невірно")
            exit()

    #якщо лютий не високосного року==================
    else: 
        if month == 2 and day > 28: 
            print("Дата введена невірно")
            exit()
else:
    print("Дата введена невірно")
    exit()

print("поточний день")
print(day, month, year)

#розрахунок дати наступного дня==================

#якщо останній день в місяці з 31 дня==================
if (month == 1 or month == 3 
        or month == 5 or month == 7 
        or month == 8 or month == 10 
        or month == 12) and day == 31:
    day = 1
    if month == 12:
        month = 1
        year += 1
    else:
        month += 1

#якщо останній день в місяці з 30 днів==================
elif (month == 4 
      or month == 6 
      or month == 9 
      or month == 11) and day == 30:
    day = 1
    month += 1

#якщо останній день лютого==================
elif month == 2:

    #якщо лютий високосного року==================
    if (year % 4 == 0 and 
        year % 100 != 0) or year % 400 == 0:

        if day == 29:
            day = 1
            month += 1

    #якщо лютий не високосного року==================        
    else:
        if day == 28:
            day = 1
            month += 1

# якщо не останній день місяця
else: day += 1                        

print("Наступний день")
print(day, month, year)        


print("\nГРА ПЕРШИЙ МІЛЬЙОН\n")

print("""Уявіть, що Ви знаходитесь в студії:
над Вами кружляє світло від прожекторів,
на фоні грає музика з телешоу ПЕРШИЙ МІЛЬЙОН\n
      ту-ту-ту-ту-ту-ту-ту-ту\n
На сцені зявляється Стас Боклан з пляшкою мінералки.
Він у своїй акторській манері повільно рекламує воду,
після чого пропонує Вам зіграти в гру ПЕРШИЙ МІЛЬЙОН 
на мінімалках. За правилами цієї гри у Вас буде
лише п\'ять запитань і не буде права на помилку.""")
  
answear1 = input("Стасік допиває воду і питає у Вас чи Ви готові? (\"так\" або \"ні\"): ")
if answear1 == "так":
    print("""    
    Гра складається з 5 питань.
    Кожне питання принесе Вам 
    200 тисяч венесуельських боліварів!
          
        ОТЖЕ РОЗПОЧНЕМО!
          """)
    print("""
┌──────────────────────────────────┐
│      Який музичний інструмент    │
│        є символом України?       │
└──────────────────────────────────┘
┌───────────┐      ┌───────────┐
│А.Балалайка│      │ Б.Укулєлє │
└───────────┘      └───────────┘
┌───────────┐      ┌───────────┐ 
│ В.Бандура │      │ Г.Бандера │ 
└───────────┘      └───────────┘ """)
    
    answear2 = input("Виберіть правильний варіант А, Б, В, Г: ")
    if answear2 == "В" or answear2 == "в":
        print("Вітаємо, Ви виграли 200 тис. венесуельських боліварів!")
        print("\nТут Стасік знов щось рекламує\n")
        print("Наступне питання, яке може принести Вам 400 тис.венесуельських боліварів")
        print("""
┌──────────────────────────────────┐
│           Яке місто              │
│      є столицею України?         │
└──────────────────────────────────┘
┌───────────┐      ┌───────────┐
│А.Київ     │      │ Б.Одеса   │
└───────────┘      └───────────┘
┌───────────┐      ┌───────────┐ 
│ В.Хрків   │      │ Г.Дніпро  │ 
└───────────┘      └───────────┘ """)
        
        answear3 = input("Виберіть правильний варіант А, Б, В, Г: ")
        if answear3 == "А" or answear3 == "а":
            print("\nВітаємо, Ви виграли 400 тис. венесуельських боліварів!")
            print("\nТУТ МОЖЕ БУТИ ВАША РЕКЛАМА\n")
            print("Наступне питання, яке може принести Вам 600 тис.венесуельських боліварів")
            print("""
    ┌──────────────────────────────────┐
    │          Хто був автором         │
    │     "Слова о полку Ігоревім"?    │
    └──────────────────────────────────┘
┌──────────────┐    ┌──────────────────────┐
│А.Син Ігоря   │    │ Б.Нестор ШУфрич      │
└──────────────┘    └──────────────────────┘
┌──────────────┐    ┌──────────────────────┐ 
│ В.Брат Ігоря │    │ Г.Нестор Літописець  │ 
└──────────────┘    └──────────────────────┘ """)
            
            answear4 = input("Виберіть правильний варіант А, Б, В, Г: ")
            if answear4 == "Г" or answear4 == "г":
                print("\nВітаємо, Ви капєц які багаті")
                print("У Вас вже 600 тис. венесуельських боліварів!")
                print("Наступне питання, яке може принести Вам 800 тис.венесуельських боліварів")
                print("""
    ┌──────────────────────────────────┐
    │            Яке свято             │
    │ відзначають в Україні 24 серпня? │
    └──────────────────────────────────┘
┌──────────────┐    ┌──────────────────────┐
│А.Новий Рік   │    │ Б.День Незалежності  │
└──────────────┘    └──────────────────────┘
┌──────────────┐    ┌──────────────────────┐ 
│В.Великдень   │    │ Г.День Конституції   │ 
└──────────────┘    └──────────────────────┘ """)
                answear5 = input("Виберіть правильний варіант А, Б, В, Г: ")
                if answear5 == "Б" or answear5 == "б":
                    print("\nВітаємо, Ви ужас які багаті")
                    print("У Вас вже 800 тис. венесуельських боліварів!")
                    print("Що будете робити з такою купою макулатури?")                    
                    print("Останнє питання, яке може зробити Вас Мільйонером!!!")
                    print("""
    ┌──────────────────────────────────┐
    │    Хто був першим Президентом    │
    │       незалежної України?        │
    └──────────────────────────────────┘
┌─────────────────┐    ┌──────────────────────┐
│А.Вєрка Сердючка │    │ Б.Леонід Кравчук     │
└─────────────────┘    └──────────────────────┘
┌─────────────────┐    ┌──────────────────────┐ 
│В.Тарас Шевченко │    │ Г.Леонід Кучма       │ 
└─────────────────┘    └──────────────────────┘ """)
                    answear6 = input("Виберіть правильний варіант А, Б, В, Г: ")
                    if answear6 == "Б" or answear6 == "б":
                        print("\nПрожектори починають неістово блимать як при блек-ауті")
                        print("На всю катушку оре музика")
                        print("\nТАМ-ТАМ-ТАМ-ТАМ-ТАМ-ТАМ-ТА-ДАAAМ\n")
                        print("Стасік витворяє кульбіти в креслі і розбризкує мінєралку \nяк чемпіон Формули-1")
                        print("\nМИ ВАС ВІТАЄМО!\n")
                        print("ВИ ВИГРАЛИ")
                        print("\n1 000 000,00\n")
                        print("!венесуельських боліварів!")
                    else: 
                        print("Нажаль, це не правильна відповідь.") 
                        print("Можливо, Вам пощастить наступного разу")
                        exit()             

                else:
                    print("Нажаль, це не правильна відповідь.")
                    print("Можливо, Вам пощастить наступного разу")
                    exit()         

            else: 
                  print("Нажаль, це не правильна відповідь.")
                  print("Можливо, Вам пощастить наступного разу")
                  exit()  

        else:
            print("Нажаль, це не правильна відповідь.")
            print("Можливо, Вам пощастить наступного разу")
            exit()    

    else: 
        print("Нажаль, це не правильна відповідь.")
        print("Можливо, Вам пощастить наступного разу")
        exit()
else: print("Нічого страшного, зустрінемось наступного разу")